app/views/journee_observations/index.html.erb

SELECT "entrees".* FROM "entrees" WHERE "entrees"."journee_observation_id" = ?  [["journee_observation_id", 624175673]]
SELECT COUNT(*) FROM "entrees" WHERE "entrees"."journee_observation_id" = ?  [["journee_observation_id", 2]]
---
                <i class="bi bi-list-check text-secondary me-1"></i>
                <strong>Entrees :</strong> <%= journee.entrees.count %>