app/views/journee_observations/show.html.erb

SELECT "entrees".* FROM "entrees" WHERE "entrees"."journee_observation_id" = ? ORDER BY "entrees"."heure" ASC  [["journee_observation_id", 2]]
---
          <tbody>
            <% @journee_observation.entrees.order(:heure).each do |entree| %>