app/controllers/entrees_controller.rb

INSERT INTO "entrees" ("journee_observation_id", "heure", "volume_boisson", "volume_urine", "urgenturies", "fuites", "commentaires", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @entree = @journee_observation.entrees.build(entree_params)
    if @entree.save

UPDATE "entrees" SET "commentaires" = ?, "updated_at" = ? WHERE "entrees"."id" = ?  [["commentaires", "Av sortie"], ["updated_at", "2026-03-22 10:11:52.922451"], ["id", 11]]
---
  def update
    if @entree.update(entree_params)

DELETE FROM "entrees" WHERE "entrees"."id" = ?  [["id", 2]]
---
  def destroy
    @entree.destroy

SELECT "journee_observations".* FROM "journee_observations" WHERE "journee_observations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_journee_observation
    @journee_observation = JourneeObservation.find(params[:journee_observation_id])

SELECT "entrees".* FROM "entrees" WHERE "entrees"."journee_observation_id" = ? AND "entrees"."id" = ? LIMIT ?  [["journee_observation_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def set_entree
    @entree = @journee_observation.entrees.find(params[:id])