app/controllers/journee_observations_controller.rb

SELECT "journee_observations".* FROM "journee_observations" WHERE "journee_observations"."date_observation" = ? LIMIT ?  [["date_observation", "2026-02-12"], ["LIMIT", 1]]
---
  def index
    @journees = JourneeObservation.par_date
    @journee_en_cours = JourneeObservation.find_by(date_observation: Date.current)

INSERT INTO "journee_observations" ("date_observation", "heure_lever", "heure_coucher", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["date_observation", "2026-02-12"], ["heure_lever", "2000-01-01 06:56:00"], ["heure_coucher", nil], ["created_at", "2026-02-12 15:53:49.189946"], ["updated_at", "2026-02-12 15:53:49.189946"]]
---
  def create
    @journee_observation = JourneeObservation.new(journee_observation_params)
    if @journee_observation.save

UPDATE "journee_observations" SET "heure_coucher" = ?, "updated_at" = ? WHERE "journee_observations"."id" = ?  [["heure_coucher", "2000-01-01 22:01:00"], ["updated_at", "2026-02-12 15:56:25.493785"], ["id", 3]]
---
  def update
    if @journee_observation.update(journee_observation_params)

DELETE FROM "journee_observations" WHERE "journee_observations"."id" = ?  [["id", 2]]
---
  def destroy
    @journee_observation.destroy

SELECT "journee_observations".* FROM "journee_observations" WHERE "journee_observations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_journee_observation
    @journee_observation = JourneeObservation.find(params[:id])