app/controllers/resultats_controller.rb

  def index
    @dates_disponibles = JourneeObservation.par_date.pluck(:date_observation)
    @selected_dates = params[:dates] || []
    @journees = if @selected_dates.any?
                  JourneeObservation.where(date_observation: @selected_dates).par_date.includes(:entrees)
---
SELECT "journee_observations"."date_observation" FROM "journee_observations" ORDER BY "journee_observations"."date_observation" DESC
SELECT "entrees".* FROM "entrees" WHERE "entrees"."journee_observation_id" IN (?, ?)  [["journee_observation_id", 4], ["journee_observation_id", 3]]
SELECT "journee_observations".* FROM "journee_observations" WHERE "journee_observations"."date_observation" IN (?, ?) ORDER BY "journee_observations"."date_observation" DESC  [["date_observation", "2026-02-13"], ["date_observation", "2026-02-12"]]

  def pdf
    selected_dates = (params[:dates] || []).reject(&:blank?)
    if selected_dates.empty?
      redirect_to resultats_path, alert: "Veuillez selectionner au moins une date."
      return
    end

    journees = JourneeObservation.where(date_observation: selected_dates).par_date.includes(:entrees)

    pdf = Prawn::Document.new(page_size: "A4", page_layout: :landscape)
    pdf.font_size 10

    pdf.text "Calendrier Mictionnel - Resultats", size: 18, style: :bold
    pdf.move_down 10

    journees.each do |journee|
---
SELECT "entrees".* FROM "entrees" WHERE "entrees"."journee_observation_id" IN (?, ?)  [["journee_observation_id", 4], ["journee_observation_id", 3]]
SELECT "journee_observations".* FROM "journee_observations" WHERE "journee_observations"."date_observation" IN (?, ?) ORDER BY "journee_observations"."date_observation" DESC  [["date_observation", "2026-02-11"], ["date_observation", "2026-02-10"]]
SELECT "entrees".* FROM "entrees" WHERE "entrees"."journee_observation_id" IN (?, ?, ?)  [["journee_observation_id", 9], ["journee_observation_id", 8], ["journee_observation_id", 7]]
SELECT "journee_observations".* FROM "journee_observations" WHERE "journee_observations"."date_observation" IN (?, ?, ?) ORDER BY "journee_observations"."date_observation" DESC  [["date_observation", "2026-03-24"], ["date_observation", "2026-03-23"], ["date_observation", "2026-03-22"]]

  def calculer_statistiques(journees)
    stats = {
      moyennes_par_jour: [],
      moyenne_globale: 0,
      moyenne_intervalle_global: 0,
      nb_mictions_global: 0,
      total_urine_global: 0,
      total_intervalles_global: 0,
      nb_intervalles_global: 0,
      miction_min: { volume: Float::INFINITY, date: nil },
      miction_max: { volume: 0, date: nil },
      top_ecarts: []
    }

    tous_les_ecarts = []

    journees.each do |journee|
      entrees_urine = journee.entrees.where.not(volume_urine: [nil, 0]).order(:heure)
      nb_mictions = entrees_urine.count
      total_urine_jour = entrees_urine.sum(:volume_urine)
      date_str = journee.date_observation.strftime("%d/%m/%Y")

      # Moyenne par jour
      moyenne = nb_mictions > 0 ? (total_urine_jour.to_f / nb_mictions).round(0) : 0

      # Moyenne intervalle par jour
      intervalles_jour = entrees_urine.where.not(intervalle_mictionnel: nil).pluck(:intervalle_mictionnel)
---
SELECT "entrees"."intervalle_mictionnel" FROM "entrees" WHERE "entrees"."journee_observation_id" = ? AND NOT (("entrees"."volume_urine" = ? OR "entrees"."volume_urine" IS NULL)) AND "entrees"."intervalle_mictionnel" IS NOT NULL ORDER BY "entrees"."heure" ASC  [["journee_observation_id", 9], ["volume_urine", 0]]