app/controllers/resultats_controller.rb

  def calculer_statistiques(journees)
    stats = {
      moyennes_par_jour: [],
      moyenne_globale: 0,
      nb_mictions_global: 0,
      total_urine_global: 0,
      miction_min: { volume: Float::INFINITY, date: nil },
      miction_max: { volume: 0, date: nil },
      top_ecarts: []
    }

    tous_les_ecarts = []

    journees.each do |journee|
      entrees_urine = journee.entrees.where.not(volume_urine: [nil, 0]).order(:heure)
      nb_mictions = entrees_urine.count
      total_urine_jour = entrees_urine.sum(:volume_urine)
      date_str = journee.date_observation.strftime("%d/%m/%Y")

      # Moyenne par jour
      moyenne = nb_mictions > 0 ? (total_urine_jour.to_f / nb_mictions).round(0) : 0
      stats[:moyennes_par_jour] << { date: date_str, moyenne: moyenne.to_i, nb_mictions: nb_mictions }

      stats[:nb_mictions_global] += nb_mictions
      stats[:total_urine_global] += total_urine_jour

      # Min / Max miction
      entrees_urine.each do |entree|
---
SELECT "entrees".* FROM "entrees" WHERE "entrees"."journee_observation_id" = ? AND NOT (("entrees"."volume_urine" = ? OR "entrees"."volume_urine" IS NULL)) ORDER BY "entrees"."heure" ASC  [["journee_observation_id", 8], ["volume_urine", 0]]