app/models/journee_observation.rb

  def recalculer_intervalles!
    mictions = entrees.where.not(volume_urine: [nil, 0]).order(:heure).to_a
    mictions.each_with_index do |entree, i|
      if i == 0
        entree.update_column(:intervalle_mictionnel, nil)
      else
        minutes = ((entree.heure - mictions[i - 1].heure) / 60).round.abs
        entree.update_column(:intervalle_mictionnel, minutes)
      end
    end
    # Les entrées sans urine n'ont pas d'intervalle
    entrees.where(volume_urine: [nil, 0]).update_all(intervalle_mictionnel: nil)
---
UPDATE "entrees" SET "intervalle_mictionnel" = ? WHERE "entrees"."id" = ?  [["intervalle_mictionnel", nil], ["id", 7]]
UPDATE "entrees" SET "intervalle_mictionnel" = ? WHERE "entrees"."id" = ?  [["intervalle_mictionnel", 120], ["id", 9]]
UPDATE "entrees" SET "intervalle_mictionnel" = ? WHERE "entrees"."journee_observation_id" = ? AND ("entrees"."volume_urine" = ? OR "entrees"."volume_urine" IS NULL)  [["intervalle_mictionnel", nil], ["journee_observation_id", 7], ["volume_urine", 0]]